app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-10-24 01:16:36.355070"], ["updated_at", "2016-10-24 01:16:36.355070"]]
---
	def create
		student = Student.create(student_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-10-24 02:24:56.495298"], ["id", 1]]
---
	def update
		student = Student.find(params[:id])
		student.update(student_params(:first_name, :last_name))